[
    {
        "id": "1",
        "title": "Police lack power to arrest Nigerians over cyberstalking",
        "body": "In a statement, the rights activist said: “It has become illegal to arrest journalists for cyberstalking, insult, causing annoyance, <br><br><br> offensive message and criminal intimidation. Section 24 of the Cybercrime Act, 2015 had criminalised ‘cyberstalking’, ‘insult’, ‘causing annoyance’, ‘sending offensive messages’, and ‘criminal intimidation’ ‘insult’, ‘causing annoyance’, ‘sending offensive messages’, and ‘criminal intimidation’. Specifically, section 24 provided as follows: (a) Any person who, knowingly or intentionally sends a message or other matter using computer systems or network that (a) is grossly offensive, pornographic or of an indecent, obscene, or menacing character or causes any such message or matter to be so sent; or (b) He knows to be false for causing annoyance, inconvenience danger, obstruction, insult, injury, criminal intimidation, enmity, hatred, ill will or needless anxiety to another or causes such a message to be sent: commits an offence under this Act and shall be liable on conviction to a fine of not more than N7million or imprisonment for a term of not more than 3 years or to both such fine and imprisonment. However, in the cases of Laws and Rights Awareness Initiative (Suit No. ECW/CCJ/APP/53/18) and Socio-Economic Rights and Accountability Project (Suit Laws and Rights Awareness Initiative (Suit No ECW/CCJ/APP/09/19), the Ecowas Court declared section 24 of the Cybercrime Act 2015 illegal and directed the federal government to amend the section to make the law conform with the fundamental rights of Nigerian citizens to freedom of expression guaranteed by section 39 of the Constitution of the Federal Republic of Nigeria,1999 and article 9 of the African Charter on Human and Peoples Rights (Ratification and Enforcement) Act, Laws of the Federation of Nigeria 2004. In line with both judgments of the Ecowas Court, the Government of Nigeria has repealed section 24 by removing the provisions relating to ‘cyber stalking’, ‘insult’, ‘causing annoyance’, ‘sending offensive messages’, and ‘criminal intimidation’ from the Cybercrime Act 2015 and replaced same with Section 5 of the Cybercrime Amendment Act which provides as follows: Any person who knowingly or intentionally sends a message or other matter using computer systems.",
        "image": "https://leadership.ng/wp-content/uploads/2022/12/cybercrime-jpg.webp"
    },
    {
        "id": "2",
        "title": "Human Rights lawyer speaks on Cybercrime Act.",
        "body": "Human Rights lawyer, Festus Ogun, speaks with IMOLEAYO OYEDEYI on the contentious 2024 Cybercrime Act and its legal lacunas that can be negatively exploited. <br> What is your take on the 2024 Cybercrime Act and how has it been interpreted so far, especially by the Nigerian Police? The amendment to the Cybercrime Act was done hurriedly and in secrecy. /n When was the bill sponsored? Was there public debate and interrogation of its provisions and peculiarities? Typical of the National Assembly under Senator Godswill Akpabio, the bill was hurriedly passed into law to generate more revenue for the government despite the excruciating economic pain suffered by our countrymen daily. Some lawyers have described the Cybercrime Act as bad for the Nigeria Police. Is it that it will work against the interest of the police? Some may jubilate that the problematic Section 24 of the Act has been amended. Still, I would rather hold the view that the purported amendment to the section was merely a Greek gift. The wording of the newly amended version is still porous and open to abuse by security agencies. In the past, Section 24(1) of the Act made it an offence to send a message via a computer system that was “grossly offensive, pornographic or of an indecent, obscene or menacing character”, or to send a message or cause any such message or matter to be so sent; or to send a message, knowing it to be false for “causing annoyance, inconvenience, danger, obstruction, insult, injury, criminal intimidation, enmity, hatred, ill will or needless anxiety to another” or to cause such a message to be sent. The nebulous and vague nature of the law gave room for security agencies, particularly the police, to clamp down on journalists and vocal citizens. However, by the amendment to Section 24(1), cyberstalking is now limited to pornographic content or contents a sender knows to be false, to cause a breakdown of law and order, or to pose a threat to life. I agree that the amendment has taken away the very nebulous provisions. I am, however, afraid that “to cause a breakdown of law and order” used in that provision can also be weaponised by the police. Who defines which publication is capable of causing the breakdown of law and order? Was it not in this country that a man was charged to court for naming his dog “Buhari” under the guise that it was capable of causing a breach of peace and a breakdown of law and order? Given the human rights dossiers of the police, I am concerned that this undefined phrase may be explored by the police to clamp down on journalists and dissent voices. It is very dangerous. Does the new Cybercrime Act imply that Nigerians can no longer be punished for things like cyber-bullying, cyber-stalking, hate speech, or fake news?",
        "image": "https://leadership.ng/wp-content/uploads/2022/12/cybercrime-jpg.webp"
    },
    {
        "id": "3",
        "title": "Nigeria making progress in fight against cyber security",
        "body": "The Regional Channel Manager, West Africa for Exclusive Networks, Mr. Wisdom Asiseh, said: “If you do the comparison between the last five years and now, there has been some good progress. Not rapid enough but I think there’s been some good progress, so we just need to keep up the progress.” Also, the Managing Director of the company, Mr. Anton Jacobsz while explaining why the company has to open its West African region office in Nigeria admitted that Nigeria is doing well in the fight. Jacobsz explained: “Ransomware threats are far from over and cybercrimes are expected to skyrocket in the coming years from 11.50 percent in 2023 to 14.57 percent in 2024 and 17.65 percent in 2025 according to Statista Technology Market Outlook. The threat of ransomware attacks is not going anywhere, in fact, it is getting bigger.” He explained that the launch of the office marks a new chapter in the company’s history of providing value-added distribution and world-class cybersecurity products and services on the continent. He also disclosed that the company has been operating in Nigeria for the past 15 years remotely and recorded $15 million in sales in FY24, but decided to deepen its investment in the country by having a physical office to further help it reach other West African countries. He revealed that the spending on cybercrime worldwide is estimated to reach $23.82 trillion by 2027 and it is ready to take the lead in the industry with its innovative solutions it is offering the Nigerian market and others. Applauding the company for its new investment, Chief Executive Officer of TigerLogic Africa, Dejo Akinyemi, one of the company partners, stated that Exclusive Networks understands the African market and has been instrumental to their growth.",
        "image": "https://leadership.ng/wp-content/uploads/2022/12/cybercrime-jpg.webp"
    }
]
